hans-jorg/stm32f746g/22-ExternalRAM/sdram.c

/**
 * @file    sdram.c
 *
 * @note    SDRAM_Init configures FMC and SDRAM to be accessed in the memory range
 *          0xC000_0000-0xC07F_FFFF (8 MBytes)
 *
 *
 * @date    07/10/2020
 * @author  Hans
 */

#include "stm32f746xx.h"
#include "system_stm32f746.h"
#include "gpio.h"
#include "sdram.h"

/**
 *  @brief  Pin initialization routines
 *
 *  @note   There are two versions:
 *          1: using direct access to register (faster but larger)
 *          2: using GPIO routines from a pin configuration table (smaller but slow))
 */
#ifndef SDRAM_FAST_INITIALIZATION
#define SDRAM_FAST_INITIALIZATION (1)
#endif


/**
 *  @brief  SDRAMBIT    generates bit mask
 */
#define SDRAMBIT(N) (1U<<(N))

/**
 * @brief   General configuration
 *
 * @note    All parameters are set for a SDRAM clock frequency of 100 MHz
 *
 * @note    The SD_CLOCK is derived from the HCLK (Core Clock).
 *
 *
 * @brief   Parameters for the MT48LC4M32B2B5
 *
 * @note    COUNT = SDRAM_Refresh_period/NROWS - 20
 *
 * @note    Refresh rate = (COUNT+1)xfreq_SDRAMCLK
 *
 * @note    Refresh rate = 64 ms/4096 = 15.625 us
 *                   This times 100 MHz = 1562
 *                   Subtract 20 as a safe margin = 1542
 *
 * @note    COUNT=(freq/64 ms)/ 4096 = 1562
 *                   Subtract 20 as a safe margin = 1542
 *
 *
 */

/*
 * OBS: There are some differences between STM32F746G Discovery Demo and
 * the code in BSP/stm32g_discovery_sdram.c
 *
 * TRAS = 6      7
 * TRC  = 6      7
 *
 */
#define SDRAM_BANK1             0
#define SDRAM_BANK2             1

// Configuration of SDCRx
#define SDRAM_RPIPE             0
#define SDRAM_RBURST            1
#define SDRAM_SDCLK             2
#define SDRAM_WP                0
#define SDRAM_CAS               0
#define SDRAM_NB                1
#define SDRAM_MWID              1
#define SDRAM_NR                1
#define SDRAM_NC                0

// Configuration of SDTRx
#define SDRAM_TRCD              2
#define SDRAM_TRP               2
#define SDRAM_TWR               2
#define SDRAM_TRC               6
#define SDRAM_TRAS              4
#define SDRAM_TXSR              6
#define SDRAM_TMRD              2


#define SDRAM_REFRESHCOUNT      1539

/**
 *  @brief  FMC Commands
 */
///@{
#define SDRAM_COMMAND_NORMAL                0x0
#define SDRAM_COMMAND_CLOCKCONFIGENABLE     0x1
#define SDRAM_COMMAND_PALL                  0x2
#define SDRAM_COMMAND_AUTOREFRESH           0x3
#define SDRAM_COMMAND_LOADMODE              0x4
#define SDRAM_COMMAND_SELF_REFRESH          0x5
#define SDRAM_COMMAND_POWERDOWN             0x6
///@}

/**
 *  @brief  SDRAM Autorefresh
 *
 *  @note   8 auto-refresh cycles every time AUTOREFRESH command is issued
 */
#define SDRAM_AUTOREFRESH                   0x7

/*
 *  @brief  Refresh count
 *
 *  @note   All rows must be refreshed every 64 ms. This can be done distributed along this time
 *          or as a burst with an interval of 60 ns.
 *
 *  @note   Refresh count depends on the SD_CLK signal
 *
 *          64 ms/4096 rows = 15.625 us
 *          15.625 us *100 MHz = 1562
 *          Subtract a safety margin (20)
 *          Counter = 1542
 *          Refresh rate = (1582+1)*100 MHz
 *
 *          OBS: 20 or 20% ??

 *  @note   It must be different from TWR+TRP+TRC+TRCD+4 memory cycles
 *
 *  @note   It must be greater than 40
 *
 */
#define SDRAM_REFRESH                       1542

/**
 *  @brief  Default timeout
 *
 *  @note   Number of tries until operation completed
 */
#define DEFAULT_TIMEOUT                     0xFFFF

/**
 *  @brief  Mode register for MT48LC4M32B2
 *
 * Configuration used
 * Burst length     =  000 (1)
 * Burst type       =    0 (Sequential)
 * CAS Latency      =  010 (2)
 * Operation mode   =   00 (Standard Operation)
 * Write Burst Mode =    1 (Single Location Access)
 *
 */

#define SDRAM_MODE   0x220


/*******************^^^^^^ To be rewamped ^^^^^^ *************************************************/



/**
 * @brief   Pin initialization
 *
 * @note    Uncomment the define USE_FAST_INITIALIZATION  to initialize without GPIO routines and
 *          tables
 *
 * @note    In initializes the pins for 12-bit address and 16-bit data.
 *
 */


#if SDRAM_FAST_INITIALIZATION == 1

static void
ConfigureFMCSDRAMPins(int bank) {
uint32_t mAND,mOR; // Mask

    // Configure pins in GPIOD
    // 0/DQ2 1/DQ3 8/DQ13 9/DQ14 10/DQ15 14/DQ0 15/DQ1

    RCC->AHB1ENR |= RCC_AHB1ENR_GPIODEN;

    mAND =   GPIO_AFRL_AFRL0_Msk
            |GPIO_AFRL_AFRL1_Msk;
    mOR  =   (12<<GPIO_AFRL_AFRL0_Pos)
            |(12<<GPIO_AFRL_AFRL1_Pos);
    GPIOD->AFR[0]  = (GPIOD->AFR[0]&~mAND)|mOR;

    mAND =   GPIO_AFRH_AFRH0_Msk
            |GPIO_AFRH_AFRH1_Msk
            |GPIO_AFRH_AFRH2_Msk
            |GPIO_AFRH_AFRH6_Msk
            |GPIO_AFRH_AFRH7_Msk;
    mOR  =   (12<<GPIO_AFRH_AFRH0_Pos)
            |(12<<GPIO_AFRH_AFRH1_Pos)
            |(12<<GPIO_AFRH_AFRH2_Pos)
            |(12<<GPIO_AFRH_AFRH6_Pos)
            |(12<<GPIO_AFRH_AFRH7_Pos);
    GPIOD->AFR[1]  = (GPIOD->AFR[1]&~mAND)|mOR;

    mAND =   GPIO_MODER_MODER0_Msk
            |GPIO_MODER_MODER1_Msk
            |GPIO_MODER_MODER8_Msk
            |GPIO_MODER_MODER9_Msk
            |GPIO_MODER_MODER10_Msk
            |GPIO_MODER_MODER14_Msk
            |GPIO_MODER_MODER15_Msk;
    mOR  =   GPIO_MODER_MODER0
            |GPIO_MODER_MODER1
            |GPIO_MODER_MODER8
            |GPIO_MODER_MODER9
            |GPIO_MODER_MODER10
            |GPIO_MODER_MODER14
            |GPIO_MODER_MODER15;
    GPIOD->MODER   = (GPIOD->MODER&~mAND)|mOR;

    mAND =   GPIO_OSPEEDR_OSPEEDR0_Msk
            |GPIO_OSPEEDR_OSPEEDR1_Msk
            |GPIO_OSPEEDR_OSPEEDR8_Msk
            |GPIO_OSPEEDR_OSPEEDR9_Msk
            |GPIO_OSPEEDR_OSPEEDR10_Msk
            |GPIO_OSPEEDR_OSPEEDR14_Msk
            |GPIO_OSPEEDR_OSPEEDR15_Msk;
    mOR  =   GPIO_OSPEEDR_OSPEEDR0
            |GPIO_OSPEEDR_OSPEEDR1
            |GPIO_OSPEEDR_OSPEEDR8
            |GPIO_OSPEEDR_OSPEEDR9
            |GPIO_OSPEEDR_OSPEEDR10
            |GPIO_OSPEEDR_OSPEEDR14
            |GPIO_OSPEEDR_OSPEEDR15;
    GPIOD->OSPEEDR = (GPIOD->OSPEEDR&~mAND)|mOR;

    mAND =   GPIO_PUPDR_PUPDR0_Msk
            |GPIO_PUPDR_PUPDR1_Msk
            |GPIO_PUPDR_PUPDR8_Msk
            |GPIO_PUPDR_PUPDR9_Msk
            |GPIO_PUPDR_PUPDR10_Msk
            |GPIO_PUPDR_PUPDR14_Msk
            |GPIO_PUPDR_PUPDR15_Msk;
    mOR  =   GPIO_PUPDR_PUPDR0
            |GPIO_PUPDR_PUPDR1
            |GPIO_PUPDR_PUPDR8
            |GPIO_PUPDR_PUPDR9
            |GPIO_PUPDR_PUPDR10
            |GPIO_PUPDR_PUPDR14
            |GPIO_PUPDR_PUPDR15;
    GPIOD->PUPDR   = (GPIOD->PUPDR&~mAND)|mOR;

