hans-jorg/stm32f746g/22-ExternalRAM/sdram.c
    mAND =   GPIO_OTYPER_OT0_Msk
            |GPIO_OTYPER_OT1_Msk
            |GPIO_OTYPER_OT8_Msk
            |GPIO_OTYPER_OT9_Msk
            |GPIO_OTYPER_OT10_Msk
            |GPIO_OTYPER_OT14_Msk
            |GPIO_OTYPER_OT15_Msk;
    mOR  =   GPIO_OTYPER_OT0
            |GPIO_OTYPER_OT1
            |GPIO_OTYPER_OT8
            |GPIO_OTYPER_OT9
            |GPIO_OTYPER_OT10
            |GPIO_OTYPER_OT14
            |GPIO_OTYPER_OT15;
    GPIOD->OTYPER  = (GPIOD->OTYPER&~mAND)|mOR;

    // Configure pins in GPIOE
    // 0/DQM0 1/DQM1 7/DQ4 8/DQ5 9/DQ6 10/DQ7 11/DQ8 12/DQ9 13/DQ10 14/DQ11 15/DQ12

    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOEEN;

    mAND =   GPIO_AFRL_AFRL0_Msk
            |GPIO_AFRL_AFRL1_Msk
            |GPIO_AFRL_AFRL7_Msk;
    mOR  =   (12<<GPIO_AFRL_AFRL0_Pos)
            |(12<<GPIO_AFRL_AFRL1_Pos)
            |(12<<GPIO_AFRL_AFRL7_Pos);
    GPIOE->AFR[0]  = (GPIOE->AFR[0]&~mAND)|mOR;

    mAND =   GPIO_AFRH_AFRH0_Msk
            |GPIO_AFRH_AFRH1_Msk
            |GPIO_AFRH_AFRH2_Msk
            |GPIO_AFRH_AFRH3_Msk
            |GPIO_AFRH_AFRH4_Msk
            |GPIO_AFRH_AFRH5_Msk
            |GPIO_AFRH_AFRH6_Msk
            |GPIO_AFRH_AFRH7_Msk;
    mOR  =   (12<<GPIO_AFRH_AFRH0_Pos)
            |(12<<GPIO_AFRH_AFRH1_Pos)
            |(12<<GPIO_AFRH_AFRH2_Pos)
            |(12<<GPIO_AFRH_AFRH3_Pos)
            |(12<<GPIO_AFRH_AFRH4_Pos)
            |(12<<GPIO_AFRH_AFRH5_Pos)
            |(12<<GPIO_AFRH_AFRH6_Pos)
            |(12<<GPIO_AFRH_AFRH7_Pos);
    GPIOE->AFR[1]  = (GPIOE->AFR[1]&~mAND)|mOR;

    mAND =   GPIO_MODER_MODER0_Msk
            |GPIO_MODER_MODER1_Msk
            |GPIO_MODER_MODER7_Msk
            |GPIO_MODER_MODER8_Msk
            |GPIO_MODER_MODER9_Msk
            |GPIO_MODER_MODER10_Msk
            |GPIO_MODER_MODER11_Msk
            |GPIO_MODER_MODER12_Msk
            |GPIO_MODER_MODER13_Msk
            |GPIO_MODER_MODER14_Msk
            |GPIO_MODER_MODER15_Msk;
    mOR  =   GPIO_MODER_MODER0
            |GPIO_MODER_MODER1
            |GPIO_MODER_MODER7
            |GPIO_MODER_MODER8
            |GPIO_MODER_MODER9
            |GPIO_MODER_MODER10
            |GPIO_MODER_MODER11
            |GPIO_MODER_MODER12
            |GPIO_MODER_MODER13
            |GPIO_MODER_MODER14
            |GPIO_MODER_MODER15;
    GPIOE->MODER   = (GPIOE->MODER&~mAND)|mOR;

    mAND =   GPIO_OSPEEDR_OSPEEDR0_Msk
            |GPIO_OSPEEDR_OSPEEDR1_Msk
            |GPIO_OSPEEDR_OSPEEDR7_Msk
            |GPIO_OSPEEDR_OSPEEDR8_Msk
            |GPIO_OSPEEDR_OSPEEDR9_Msk
            |GPIO_OSPEEDR_OSPEEDR10_Msk
            |GPIO_OSPEEDR_OSPEEDR11_Msk
            |GPIO_OSPEEDR_OSPEEDR12_Msk
            |GPIO_OSPEEDR_OSPEEDR13_Msk
            |GPIO_OSPEEDR_OSPEEDR14_Msk
            |GPIO_OSPEEDR_OSPEEDR15_Msk;
    mOR  =   GPIO_OSPEEDR_OSPEEDR0
            |GPIO_OSPEEDR_OSPEEDR1
            |GPIO_OSPEEDR_OSPEEDR7
            |GPIO_OSPEEDR_OSPEEDR8
            |GPIO_OSPEEDR_OSPEEDR9
            |GPIO_OSPEEDR_OSPEEDR10
            |GPIO_OSPEEDR_OSPEEDR11
            |GPIO_OSPEEDR_OSPEEDR12
            |GPIO_OSPEEDR_OSPEEDR13
            |GPIO_OSPEEDR_OSPEEDR14
            |GPIO_OSPEEDR_OSPEEDR15;
    GPIOE->OSPEEDR = (GPIOE->OSPEEDR&~mAND)|mOR;

    mAND =   GPIO_PUPDR_PUPDR0_Msk
            |GPIO_PUPDR_PUPDR1_Msk
            |GPIO_PUPDR_PUPDR7_Msk
            |GPIO_PUPDR_PUPDR8_Msk
            |GPIO_PUPDR_PUPDR9_Msk
            |GPIO_PUPDR_PUPDR10_Msk
            |GPIO_PUPDR_PUPDR11_Msk
            |GPIO_PUPDR_PUPDR12_Msk
            |GPIO_PUPDR_PUPDR13_Msk
            |GPIO_PUPDR_PUPDR14_Msk
            |GPIO_PUPDR_PUPDR15_Msk;
    mOR  =   GPIO_PUPDR_PUPDR0
            |GPIO_PUPDR_PUPDR1
            |GPIO_PUPDR_PUPDR7
            |GPIO_PUPDR_PUPDR8
            |GPIO_PUPDR_PUPDR9
            |GPIO_PUPDR_PUPDR10
            |GPIO_PUPDR_PUPDR11
            |GPIO_PUPDR_PUPDR12
            |GPIO_PUPDR_PUPDR13
            |GPIO_PUPDR_PUPDR14
            |GPIO_PUPDR_PUPDR15;
    GPIOE->PUPDR   = (GPIOE->PUPDR&~mAND)|mOR;

    mAND =   GPIO_OTYPER_OT0_Msk
            |GPIO_OTYPER_OT1_Msk
            |GPIO_OTYPER_OT7_Msk
            |GPIO_OTYPER_OT8_Msk
            |GPIO_OTYPER_OT9_Msk
            |GPIO_OTYPER_OT10_Msk
            |GPIO_OTYPER_OT11_Msk
            |GPIO_OTYPER_OT12_Msk
            |GPIO_OTYPER_OT13_Msk
            |GPIO_OTYPER_OT14_Msk
            |GPIO_OTYPER_OT15_Msk;
    mOR  =   GPIO_OTYPER_OT0
            |GPIO_OTYPER_OT1
            |GPIO_OTYPER_OT7
            |GPIO_OTYPER_OT8
            |GPIO_OTYPER_OT9
            |GPIO_OTYPER_OT10
            |GPIO_OTYPER_OT11
            |GPIO_OTYPER_OT12
            |GPIO_OTYPER_OT13
            |GPIO_OTYPER_OT14
            |GPIO_OTYPER_OT15;
    GPIOE->OTYPER  = (GPIOE->OTYPER&~mAND)|mOR;

    // Configure pins in GPIOF
    // 0/A0 1/A1 2/A2 3/A3 4/A4 5/A5 11/RAS 12/A6 13/A7 14/A8 15/A9

    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOFEN;

    mAND =   GPIO_AFRL_AFRL0_Msk
            |GPIO_AFRL_AFRL1_Msk
            |GPIO_AFRL_AFRL2_Msk
            |GPIO_AFRL_AFRL3_Msk
            |GPIO_AFRL_AFRL4_Msk
            |GPIO_AFRL_AFRL5_Msk;
    mOR  =   (12<<GPIO_AFRL_AFRL0_Pos)
            |(12<<GPIO_AFRL_AFRL1_Pos)
            |(12<<GPIO_AFRL_AFRL2_Pos)
            |(12<<GPIO_AFRL_AFRL3_Pos)
            |(12<<GPIO_AFRL_AFRL4_Pos)
            |(12<<GPIO_AFRL_AFRL5_Pos);
    GPIOF->AFR[0]  = (GPIOF->AFR[0]&~mAND)|mOR;

    mAND =   GPIO_AFRH_AFRH3_Msk
            |GPIO_AFRH_AFRH4_Msk
            |GPIO_AFRH_AFRH5_Msk
            |GPIO_AFRH_AFRH6_Msk
            |GPIO_AFRH_AFRH7_Msk;
    mOR  =   (12<<GPIO_AFRH_AFRH3_Pos)
            |(12<<GPIO_AFRH_AFRH4_Pos)
            |(12<<GPIO_AFRH_AFRH5_Pos)
            |(12<<GPIO_AFRH_AFRH6_Pos)
            |(12<<GPIO_AFRH_AFRH7_Pos);
    GPIOF->AFR[1]  = (GPIOF->AFR[1]&~mAND)|mOR;

    mAND =   GPIO_MODER_MODER0_Msk
            |GPIO_MODER_MODER1_Msk
            |GPIO_MODER_MODER2_Msk
            |GPIO_MODER_MODER3_Msk
            |GPIO_MODER_MODER4_Msk
            |GPIO_MODER_MODER5_Msk
            |GPIO_MODER_MODER11_Msk
            |GPIO_MODER_MODER12_Msk
            |GPIO_MODER_MODER13_Msk
            |GPIO_MODER_MODER14_Msk
            |GPIO_MODER_MODER15_Msk;
    mOR  =   GPIO_MODER_MODER0
            |GPIO_MODER_MODER1
            |GPIO_MODER_MODER2
            |GPIO_MODER_MODER3
            |GPIO_MODER_MODER4
            |GPIO_MODER_MODER5
            |GPIO_MODER_MODER11
            |GPIO_MODER_MODER12
            |GPIO_MODER_MODER13
            |GPIO_MODER_MODER14
            |GPIO_MODER_MODER15;
    GPIOF->MODER   = (GPIOF->MODER&~mAND)|mOR;

    mAND =   GPIO_OSPEEDR_OSPEEDR0_Msk
            |GPIO_OSPEEDR_OSPEEDR1_Msk
            |GPIO_OSPEEDR_OSPEEDR2_Msk
            |GPIO_OSPEEDR_OSPEEDR3_Msk
            |GPIO_OSPEEDR_OSPEEDR4_Msk
            |GPIO_OSPEEDR_OSPEEDR5_Msk
            |GPIO_OSPEEDR_OSPEEDR11_Msk
            |GPIO_OSPEEDR_OSPEEDR12_Msk
            |GPIO_OSPEEDR_OSPEEDR13_Msk
            |GPIO_OSPEEDR_OSPEEDR14_Msk
            |GPIO_OSPEEDR_OSPEEDR15_Msk;
    mOR  =   GPIO_OSPEEDR_OSPEEDR0
            |GPIO_OSPEEDR_OSPEEDR1
            |GPIO_OSPEEDR_OSPEEDR2
            |GPIO_OSPEEDR_OSPEEDR3
            |GPIO_OSPEEDR_OSPEEDR4
            |GPIO_OSPEEDR_OSPEEDR5
            |GPIO_OSPEEDR_OSPEEDR11
            |GPIO_OSPEEDR_OSPEEDR12
            |GPIO_OSPEEDR_OSPEEDR13
            |GPIO_OSPEEDR_OSPEEDR14
            |GPIO_OSPEEDR_OSPEEDR15;
    GPIOF->OSPEEDR = (GPIOF->OSPEEDR&~mAND)|mOR;

    mAND =   GPIO_PUPDR_PUPDR0_Msk
            |GPIO_PUPDR_PUPDR1_Msk
            |GPIO_PUPDR_PUPDR2_Msk
            |GPIO_PUPDR_PUPDR3_Msk
            |GPIO_PUPDR_PUPDR4_Msk
            |GPIO_PUPDR_PUPDR5_Msk
            |GPIO_PUPDR_PUPDR11_Msk
            |GPIO_PUPDR_PUPDR12_Msk
            |GPIO_PUPDR_PUPDR13_Msk
            |GPIO_PUPDR_PUPDR14_Msk
            |GPIO_PUPDR_PUPDR15_Msk;
    mOR  =   GPIO_PUPDR_PUPDR0
            |GPIO_PUPDR_PUPDR1
            |GPIO_PUPDR_PUPDR2
            |GPIO_PUPDR_PUPDR3
            |GPIO_PUPDR_PUPDR4
            |GPIO_PUPDR_PUPDR5
            |GPIO_PUPDR_PUPDR11
            |GPIO_PUPDR_PUPDR12
            |GPIO_PUPDR_PUPDR13
            |GPIO_PUPDR_PUPDR14
            |GPIO_PUPDR_PUPDR15;
    GPIOF->PUPDR   = (GPIOF->PUPDR&~mAND)|mOR;

