hans-jorg/stm32f746g/22-ExternalRAM/sdram.c
    mAND =   GPIO_OTYPER_OT0_Msk
            |GPIO_OTYPER_OT1_Msk
            |GPIO_OTYPER_OT2_Msk
            |GPIO_OTYPER_OT3_Msk
            |GPIO_OTYPER_OT4_Msk
            |GPIO_OTYPER_OT5_Msk
            |GPIO_OTYPER_OT11_Msk
            |GPIO_OTYPER_OT12_Msk
            |GPIO_OTYPER_OT13_Msk
            |GPIO_OTYPER_OT14_Msk
            |GPIO_OTYPER_OT15_Msk;
    mOR  =   GPIO_OTYPER_OT0
            |GPIO_OTYPER_OT1
            |GPIO_OTYPER_OT2
            |GPIO_OTYPER_OT3
            |GPIO_OTYPER_OT4
            |GPIO_OTYPER_OT5
            |GPIO_OTYPER_OT11
            |GPIO_OTYPER_OT12
            |GPIO_OTYPER_OT13
            |GPIO_OTYPER_OT14
            |GPIO_OTYPER_OT15;
    GPIOF->OTYPER  = (GPIOF->OTYPER&~mAND)|mOR;

    // Configure pins in GPIOG
    // 0/A10 1/A11 4/BA0 5/BA1 8/CLK 15/CAS

    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOGEN;

    mAND =   GPIO_AFRL_AFRL0_Msk
            |GPIO_AFRL_AFRL1_Msk
            |GPIO_AFRL_AFRL4_Msk
            |GPIO_AFRL_AFRL5_Msk;
    mOR  =   (12<<GPIO_AFRL_AFRL0_Pos)
            |(12<<GPIO_AFRL_AFRL1_Pos)
            |(12<<GPIO_AFRL_AFRL4_Pos)
            |(12<<GPIO_AFRL_AFRL5_Pos);
    GPIOG->AFR[0]  = (GPIOG->AFR[0]&~mAND)|mOR;

    mAND =   GPIO_AFRH_AFRH0_Msk
            |GPIO_AFRH_AFRH7_Msk;
    mOR  =   (12<<GPIO_AFRH_AFRH0_Pos)
            |(12<<GPIO_AFRH_AFRH7_Pos);
    GPIOG->AFR[1]  = (GPIOG->AFR[1]&~mAND)|mOR;

    mAND =   GPIO_MODER_MODER0_Msk
            |GPIO_MODER_MODER1_Msk
            |GPIO_MODER_MODER4_Msk
            |GPIO_MODER_MODER5_Msk
            |GPIO_MODER_MODER8_Msk
            |GPIO_MODER_MODER15_Msk;
    mOR  =   GPIO_MODER_MODER0
            |GPIO_MODER_MODER1
            |GPIO_MODER_MODER4
            |GPIO_MODER_MODER5
            |GPIO_MODER_MODER8
            |GPIO_MODER_MODER15;
    GPIOG->MODER   = (GPIOG->MODER&~mAND)|mOR;

    mAND =   GPIO_OSPEEDR_OSPEEDR0_Msk
            |GPIO_OSPEEDR_OSPEEDR1_Msk
            |GPIO_OSPEEDR_OSPEEDR4_Msk
            |GPIO_OSPEEDR_OSPEEDR5_Msk
            |GPIO_OSPEEDR_OSPEEDR8_Msk
            |GPIO_OSPEEDR_OSPEEDR15_Msk;
    mOR  =   GPIO_OSPEEDR_OSPEEDR0
            |GPIO_OSPEEDR_OSPEEDR1
            |GPIO_OSPEEDR_OSPEEDR4
            |GPIO_OSPEEDR_OSPEEDR5
            |GPIO_OSPEEDR_OSPEEDR8
            |GPIO_OSPEEDR_OSPEEDR15;
    GPIOG->OSPEEDR = (GPIOG->OSPEEDR&~mAND)|mOR;

    mAND =   GPIO_PUPDR_PUPDR0_Msk
            |GPIO_PUPDR_PUPDR1_Msk
            |GPIO_PUPDR_PUPDR4_Msk
            |GPIO_PUPDR_PUPDR5_Msk
            |GPIO_PUPDR_PUPDR8_Msk
            |GPIO_PUPDR_PUPDR15_Msk;
    mOR  =   GPIO_PUPDR_PUPDR0
            |GPIO_PUPDR_PUPDR1
            |GPIO_PUPDR_PUPDR4
            |GPIO_PUPDR_PUPDR5
            |GPIO_PUPDR_PUPDR8
            |GPIO_PUPDR_PUPDR15;
    GPIOG->PUPDR   = (GPIOG->PUPDR&~mAND)|mOR;

    mAND =   GPIO_OTYPER_OT0_Msk
            |GPIO_OTYPER_OT1_Msk
            |GPIO_OTYPER_OT4_Msk
            |GPIO_OTYPER_OT5_Msk
            |GPIO_OTYPER_OT8_Msk
            |GPIO_OTYPER_OT15_Msk;
    mOR  =   GPIO_OTYPER_OT0
            |GPIO_OTYPER_OT1
            |GPIO_OTYPER_OT4
            |GPIO_OTYPER_OT5
            |GPIO_OTYPER_OT8
            |GPIO_OTYPER_OT15;
    GPIOG->OTYPER  = (GPIOG->OTYPER&~mAND)|mOR;

    // Configure pins in GPIOH
    // 5/WE

    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOHEN;

    mAND =   GPIO_AFRL_AFRL5_Msk;
    mOR  =   (12<<GPIO_AFRL_AFRL5_Pos);
    GPIOH->AFR[0]  = (GPIOH->AFR[0]&~mAND)|mOR;

    mAND =   0;
    mOR  =   0;
    GPIOH->AFR[1]  = (GPIOH->AFR[1]&~mAND)|mOR;

    mAND =   GPIO_MODER_MODER5_Msk;
    mOR  =   GPIO_MODER_MODER5;
    GPIOH->MODER   = (GPIOH->MODER&~mAND)|mOR;

    mAND =   GPIO_OSPEEDR_OSPEEDR5_Msk;
    mOR  =   GPIO_OSPEEDR_OSPEEDR5;
    GPIOH->OSPEEDR = (GPIOH->OSPEEDR&~mAND)|mOR;

    mAND =   GPIO_PUPDR_PUPDR5_Msk;
    mOR  =   GPIO_PUPDR_PUPDR5;
    GPIOH->PUPDR   = (GPIOH->PUPDR&~mAND)|mOR;

    mAND =   GPIO_OTYPER_OT5_Msk;
    mOR  =   GPIO_OTYPER_OT5;
    GPIOH->OTYPER  = (GPIOH->OTYPER&~mAND)|mOR;

    /*
     * SDCKEx and SDNEx are bank specific
     * SDCKE0 : PH2 or PC3 (PC3 used in the Discovery board)
     * SDNE0  : PH3 or PC4 (PH3 used in the Discovery board)
     * SDCKE1 : PH7
     * SDNE1  : PH6
     *
     ()*/
    if( bank == SDRAM_BANK1 ) {
        // Configure pins in GPIOC
        // 3/CLKE

        RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;

        mAND = GPIO_AFRL_AFRL3_Msk;
        mOR  = (12<<GPIO_AFRL_AFRL3_Pos);
        GPIOC->AFR[0]  = (GPIOC->AFR[0]&~mAND)|mOR;

        mAND = GPIO_MODER_MODER3_Msk;
        mOR  = GPIO_MODER_MODER3;
        GPIOC->MODER   = (GPIOC->MODER&~mAND)|mOR;

        mAND = GPIO_OSPEEDR_OSPEEDR3_Msk;
        mOR  = GPIO_OSPEEDR_OSPEEDR3;
        GPIOC->OSPEEDR = (GPIOC->OSPEEDR&~mAND)|mOR;

        mAND = GPIO_PUPDR_PUPDR3_Msk;
        mOR  = GPIO_PUPDR_PUPDR3;
        GPIOC->PUPDR   = (GPIOC->PUPDR&~mAND)|mOR;

        mAND = GPIO_OTYPER_OT0_Msk;
        mOR  = GPIO_OTYPER_OT3;
        GPIOC->OTYPER  = (GPIOC->OTYPER&~mAND)|mOR;

        // Configure pins in GPIOH
        // 3/CS

        RCC->AHB1ENR |= RCC_AHB1ENR_GPIOHEN;

        mAND =   GPIO_AFRL_AFRL3_Msk;
        mOR  =   (12<<GPIO_AFRL_AFRL3_Pos);
        GPIOH->AFR[0]  = (GPIOH->AFR[0]&~mAND)|mOR;

        mAND =   0;
        mOR  =   0;
        GPIOH->AFR[1]  = (GPIOH->AFR[1]&~mAND)|mOR;

        mAND =   GPIO_MODER_MODER3_Msk;
        mOR  =   GPIO_MODER_MODER3;
        GPIOH->MODER   = (GPIOH->MODER&~mAND)|mOR;

        mAND =   GPIO_OSPEEDR_OSPEEDR3_Msk;
        mOR  =   GPIO_OSPEEDR_OSPEEDR3;
        GPIOH->OSPEEDR = (GPIOH->OSPEEDR&~mAND)|mOR;

        mAND =   GPIO_PUPDR_PUPDR3_Msk;
        mOR  =   GPIO_PUPDR_PUPDR3;
        GPIOH->PUPDR   = (GPIOH->PUPDR&~mAND)|mOR;

        mAND =   GPIO_OTYPER_OT3_Msk;
        mOR  =   GPIO_OTYPER_OT3;
        GPIOH->OTYPER  = (GPIOH->OTYPER&~mAND)|mOR;

    } else if ( bank == SDRAM_BANK2 ) {
        // Configure pins in GPIOH
        // 6/CS 7/CKE for Bank2 (There are alternatives on PB6 and PB5)

        RCC->AHB1ENR |= RCC_AHB1ENR_GPIOHEN;

        mAND =   GPIO_AFRL_AFRL6_Msk
                |GPIO_AFRL_AFRL7_Msk;
        mOR  =   (12<<GPIO_AFRL_AFRL0_Pos)
                |(12<<GPIO_AFRL_AFRL5_Pos);
        GPIOH->AFR[0]  = (GPIOG->AFR[0]&~mAND)|mOR;

        mAND =   GPIO_AFRH_AFRH6_Msk
                |GPIO_AFRH_AFRH7_Msk;
        mOR  =   (12<<GPIO_AFRH_AFRH6_Pos)
                |(12<<GPIO_AFRH_AFRH7_Pos);
        GPIOH->AFR[1]  = (GPIOH->AFR[1]&~mAND)|mOR;

