hans-jorg/stm32f746g/22-ExternalRAM/sdram.c
        mAND =   GPIO_MODER_MODER6_Msk
                |GPIO_MODER_MODER7_Msk;
        mOR  =   GPIO_MODER_MODER6
                |GPIO_MODER_MODER7;
        GPIOH->MODER   = (GPIOH->MODER&~mAND)|mOR;

        mAND =   GPIO_OSPEEDR_OSPEEDR6_Msk
                |GPIO_OSPEEDR_OSPEEDR7_Msk;
        mOR  =   GPIO_OSPEEDR_OSPEEDR6
                |GPIO_OSPEEDR_OSPEEDR7;
        GPIOH->OSPEEDR = (GPIOH->OSPEEDR&~mAND)|mOR;

        mAND =   GPIO_PUPDR_PUPDR6_Msk
                |GPIO_PUPDR_PUPDR7_Msk;
        mOR  =   GPIO_PUPDR_PUPDR6
                |GPIO_PUPDR_PUPDR7;
        GPIOH->PUPDR   = (GPIOH->PUPDR&~mAND)|mOR;

        mAND =   GPIO_OTYPER_OT6_Msk
                |GPIO_OTYPER_OT7_Msk;
        mOR  =   GPIO_OTYPER_OT6
                |GPIO_OTYPER_OT7;
        GPIOH->OTYPER  = (GPIOH->OTYPER&~mAND)|mOR;

    }

}
#else

static const GPIO_PinConfiguration pinconfig_common[] = {
   {  GPIOD,   14,      12  },       //     DQ0
   {  GPIOD,   15,      12  },       //     DQ1
   {  GPIOD,   0,       12  },       //     DQ2
   {  GPIOD,   1,       12  },       //     DQ3
   {  GPIOE,   7,       12  },       //     DQ4
   {  GPIOE,   8,       12  },       //     DQ5
   {  GPIOE,   9,       12  },       //     DQ6
   {  GPIOE,   10,      12  },       //     DQ7
   {  GPIOE,   11,      12  },       //     DQ8
   {  GPIOE,   12,      12  },       //     DQ9
   {  GPIOE,   13,      12  },       //     DQ10
   {  GPIOE,   14,      12  },       //     DQ11
   {  GPIOE,   15,      12  },       //     DQ12
   {  GPIOD,   8,       12  },       //     DQ13
   {  GPIOD,   9,       12  },       //     DQ14
   {  GPIOD,   10,      12  },       //     DQ15
   {  GPIOF,   0,       12  },       //     A0
   {  GPIOF,   1,       12  },       //     A1
   {  GPIOF,   2,       12  },       //     A2
   {  GPIOF,   3,       12  },       //     A3
   {  GPIOF,   4,       12  },       //     A4
   {  GPIOF,   5,       12  },       //     A5
   {  GPIOF,   12,      12  },       //     A6
   {  GPIOF,   13,      12  },       //     A7
   {  GPIOF,   14,      12  },       //     A8
   {  GPIOF,   15,      12  },       //     A9
   {  GPIOG,   0,       12  },       //     A10
   {  GPIOG,   1,       12  },       //     A11
   {  GPIOG,   4,       12  },       //     BA0
   {  GPIOG,   5,       12  },       //     BA1
   {  GPIOF,   11,      12  },       //     RAS
   {  GPIOG,   15,      12  },       //     CAS
   {  GPIOH,   5,       12  },       //     WE
   {  GPIOG,   8,       12  },       //     CLK
   {  GPIOE,   0,       12  },       //     DQM0
   {  GPIOE,   1,       12  },       //     DQM1
//
   {     0,    0,       0  }         // End of List Mark
};


static const GPIO_PinConfiguration pinconfig_bank1[] = {
    // PC3/CLKE, PH3/CS
   {  GPIOC,   3,       12  },       //     CS = SDNE0
   {  GPIOH,   3,       12  },       //     CLKE = SDNE0
   {     0,    0,       0  }         // End of List Mark
};

static const GPIO_PinConfiguration pinconfig_bank2[] = {
    // 6/CS 7/CLKE for Bank2 (There are alternatives on PB6 and PB5)
   {  GPIOH,   6,       12  },       //     SDNE1
   {  GPIOH,   7,       12  },       //     SDCKE1
   {     0,    0,       0  }         // End of List Mark
};

static void
ConfigureFMCSDRAMPins(int bank) {

    /* Configure pins from table*/
    GPIO_ConfigureMultiplePins(pinconfig_common);

    if( bank == SDRAM_BANK1 ) {
        GPIO_ConfigureMultiplePins(pinconfig_bank1);
    } else {
        GPIO_ConfigureMultiplePins(pinconfig_bank2);
    }
}
#endif


/**
 *  @brief  EnableFMCClock
 *
 */

static void
EnableFMCClock(void) {

    RCC->AHB3ENR |= RCC_AHB3ENR_FMCEN;

}


/**
 *  @brief  Send Command to FMC
 *
 *  @note   Only for SDRAM Bank 1 (=FMC Bank 5)
 *
 *  @note   Parameters are in the same format of SDCMR Register
 *
 *  @note   returns 0 when runs OK or -1 if a timeout occurs
 */
static int
SendCommand(int bank, uint32_t command, uint32_t parameters, uint32_t timeout) {

    parameters &= ~(FMC_SDCMR_MODE_Msk|FMC_SDCMR_CTB1|FMC_SDCMR_CTB2);
    FMC_Bank5_6->SDCMR=(command<<FMC_SDCMR_MODE_Pos)|FMC_SDCMR_CTB1|parameters;

    while( (FMC_Bank5_6->SDSR&FMC_SDSR_BUSY) &&(timeout-->0) ) {}

    if( FMC_Bank5_6->SDSR&FMC_SDSR_BUSY )
        return 0;
    else
        return -1;
}


/**
 * @brief   SmallDelay
 *
 * @note    Quick and dirty small delay routine
 */
static void
SmallDelay(volatile uint32_t v) {

    while(v--) {}
}

/**
 *  @brief  ConfigureFMC for SDRAM
 *
 *  @note   All parameters for f_SDCLOCK = 100 MHz
 *
 *  @note   The SDRAM is in SDRAM Bank 1 (FMC Bank 5)
 *
 *  @note   FMC is configured to run at half the speed of the core.
 *
 *  @note   Autorefresh = 1 always?
 */

static void
ConfigureFMCSDRAM(int bank) {
uint32_t sdcr1,sdcr2;
uint32_t sdtr1,sdtr2;


    if( bank == SDRAM_BANK1 ) {
        sdcr1 = FMC_Bank5_6->SDCR[SDRAM_BANK1];
        sdtr1 = FMC_Bank5_6->SDTR[SDRAM_BANK1];
        /* Clear fields in SDCR1 */
        sdcr1 &=   ~(FMC_SDCR1_RPIPE_Msk
                    |FMC_SDCR1_RBURST_Msk
                    |FMC_SDCR1_SDCLK_Msk
                    |FMC_SDCR1_WP_Msk
                    |FMC_SDCR1_CAS_Msk
                    |FMC_SDCR1_MWID_Msk
                    |FMC_SDCR1_NR_Msk
                    |FMC_SDCR1_NC_Msk);
        /* Set fields in SDCR1 */
        sdcr1 |=    (SDRAM_RPIPE<<FMC_SDCR1_RPIPE_Pos)
                    |(SDRAM_RBURST<<FMC_SDCR1_RBURST_Pos)
                    |(SDRAM_SDCLK<<FMC_SDCR1_SDCLK_Pos)
                    |(SDRAM_WP<<FMC_SDCR1_WP_Pos)
                    |(SDRAM_CAS<<FMC_SDCR1_CAS_Pos)
                    |(SDRAM_NB<<FMC_SDCR1_NB_Pos)
                    |(SDRAM_MWID<<FMC_SDCR1_MWID_Pos)
                    |(SDRAM_NR<<FMC_SDCR1_NR_Pos)
                    |(SDRAM_NC<<FMC_SDCR1_NC_Pos);
        /* Clear fields in SDTR1 */
        sdtr1  &=   ~(FMC_SDTR1_TRCD_Msk)
                    |(FMC_SDTR1_TRP_Msk)
                    |(FMC_SDTR1_TWR_Msk)
                    |(FMC_SDTR1_TRC_Msk)
                    |(FMC_SDTR1_TRAS_Msk)
                    |(FMC_SDTR1_TXSR_Msk)
                    |(FMC_SDTR1_TMRD_Msk);
        /* Set fields in SDTR1 */
        sdtr1  |=    (SDRAM_TRCD<<FMC_SDTR1_TRCD_Pos)
                    |(SDRAM_TRP<<FMC_SDTR1_TRP_Pos)
                    |(SDRAM_TWR<<FMC_SDTR1_TWR_Pos)
                    |(SDRAM_TRC<<FMC_SDTR1_TRC_Pos)
                    |(SDRAM_TRAS<<FMC_SDTR1_TRAS_Pos)
                    |(SDRAM_TXSR<<FMC_SDTR1_TXSR_Pos)
                    |(SDRAM_TMRD<<FMC_SDTR1_TMRD_Pos);

        FMC_Bank5_6->SDCR[SDRAM_BANK1] = sdcr1;
        FMC_Bank5_6->SDTR[SDRAM_BANK1] = sdtr1;
    } else {
        sdcr1 = FMC_Bank5_6->SDCR[SDRAM_BANK1];
        sdcr2 = FMC_Bank5_6->SDCR[SDRAM_BANK2];
        sdtr1 = FMC_Bank5_6->SDTR[SDRAM_BANK1];
        sdtr2 = FMC_Bank5_6->SDTR[SDRAM_BANK2];
        /* Clear fields that only can be written in SDCR1 */
        sdcr1 &=   ~(FMC_SDCR1_RPIPE_Msk
                    |FMC_SDCR1_RBURST_Msk
                    |FMC_SDCR1_SDCLK_Msk);
        /* Set fields in SDCR1 */
        sdcr1 |=    (SDRAM_RPIPE<<FMC_SDCR1_RPIPE_Pos)
                    |(SDRAM_RBURST<<FMC_SDCR1_RBURST_Pos)
                    |(SDRAM_SDCLK<<FMC_SDCR1_SDCLK_Pos);
        /* Clear fields in SDCR2 */
        sdcr2 &=   ~(FMC_SDCR1_WP_Msk
                    |FMC_SDCR1_CAS_Msk
                    |FMC_SDCR1_MWID_Msk
                    |FMC_SDCR1_NR_Msk
                    |FMC_SDCR1_NC_Msk);
        /* Set fields in SDCR2 */
        sdcr2 |=     (SDRAM_WP<<FMC_SDCR1_WP_Pos)
                    |(SDRAM_CAS<<FMC_SDCR1_CAS_Pos)
                    |(SDRAM_NB<<FMC_SDCR1_NB_Pos)
                    |(SDRAM_MWID<<FMC_SDCR1_MWID_Pos)
                    |(SDRAM_NR<<FMC_SDCR1_NR_Pos)
                    |(SDRAM_NC<<FMC_SDCR1_NC_Pos);
        /* Clear fields that only can be written in SDTR1 */
        sdtr1 &=   ~(FMC_SDTR1_TWR_Msk);
        /* Set fields that only can be writter in SDTR1 */
        sdtr1 |=    (SDRAM_TWR<<FMC_SDTR1_TWR_Pos);
        /* Clear fields in SDTR2 */
        sdtr2  &    ~(FMC_SDTR1_TRCD_Msk)
                    |(FMC_SDTR1_TRP_Msk)
                    |(FMC_SDTR1_TRC_Msk)
                    |(FMC_SDTR1_TRAS_Msk)
                    |(FMC_SDTR1_TXSR_Msk)
                    |(FMC_SDTR1_TMRD_Msk);
        /* Set fields in SDTR2 */
        sdtr2  =     (SDRAM_TRCD<<FMC_SDTR1_TRCD_Pos)
                    |(SDRAM_TRP<<FMC_SDTR1_TRP_Pos)
                    |(SDRAM_TRC<<FMC_SDTR1_TRC_Pos)
                    |(SDRAM_TRAS<<FMC_SDTR1_TRAS_Pos)
                    |(SDRAM_TXSR<<FMC_SDTR1_TXSR_Pos)
                    |(SDRAM_TMRD<<FMC_SDTR1_TMRD_Pos);

        FMC_Bank5_6->SDCR[SDRAM_BANK1] = sdcr1;
        FMC_Bank5_6->SDCR[SDRAM_BANK2] = sdcr2;
        FMC_Bank5_6->SDTR[SDRAM_BANK1] = sdtr1;
        FMC_Bank5_6->SDTR[SDRAM_BANK2] = sdtr2;
    }

