hans-jorg/stm32f746g/22-ExternalRAM/sdram.c
    sdtr1  =     (SDRAM_TRCD<<FMC_SDTR1_TRCD_Pos)
                |(SDRAM_TRP<<FMC_SDTR1_TRP_Pos)
                |(SDRAM_TWR<<FMC_SDTR1_TWR_Pos)
                |(SDRAM_TRC<<FMC_SDTR1_TRC_Pos)
                |(SDRAM_TRAS<<FMC_SDTR1_TRAS_Pos)
                |(SDRAM_TXSR<<FMC_SDTR1_TXSR_Pos)
                |(SDRAM_TMRD<<FMC_SDTR1_TMRD_Pos);


}

/**
 *  @brief  Configure Refresh Rate
 *
 */
static void
ConfigureSDRAMRefresh(int bank) {

    /* Set refresh count */
    FMC_Bank5_6->SDRTR = (FMC_Bank5_6->SDRTR&~(FMC_SDRTR_COUNT_Msk))
                |(SDRAM_REFRESH<<FMC_SDRTR_COUNT_Pos);

    /* Disable write protection */
    FMC_Bank5_6->SDCR[bank] &= ~(FMC_SDCR1_WP);

}
/**
 *  @brief  ConfigureFMC for SDRAM
 *
 *  @note   All parameters for f_SDCLOCK = 100 MHz
 *
 *  @note   The FCM SDRAM interface must be configured to run at half the speed
 *          of the core.
 *
 *  @note   Autorefresh = 1 always
 */

static void
ConfigureSDRAM(int bank) {

    /*
     * SDRAM initialization sequence
     */

    /* Clock enable command */
    SendCommand(bank,SDRAM_COMMAND_CLOCKCONFIGENABLE,0x0000,DEFAULT_TIMEOUT);

    SmallDelay(1000);       // 100 us, maybe systick is better */

    /* PALL command */
    SendCommand(bank,SDRAM_COMMAND_PALL,0x0000,DEFAULT_TIMEOUT);

    /* Auto refresh command */
    SendCommand(bank,SDRAM_COMMAND_AUTOREFRESH,(SDRAM_AUTOREFRESH<<FMC_SDCMR_NRFS_Pos),DEFAULT_TIMEOUT);

    /* MRD register program */
    SendCommand(bank,SDRAM_COMMAND_LOADMODE,(SDRAM_MODE<<FMC_SDCMR_MRD_Pos),DEFAULT_TIMEOUT);


}

/**
 * @brief   SDRAM Init
 *
 * @note    Initializes the FMC unit and configure access to a SDRAM
 *
 * @note    HCLK must be 200 MHz!!!!
 */
int
SDRAM_Init(void) {

    if( SystemCoreClock != SDRAM_CLOCKFREQUENCY )
        return -1;

    // Enable clock for FMC
    EnableFMCClock();

    /* Configure FMC pins for SDRAM interface*/
    ConfigureFMCSDRAMPins(SDRAM_BANK1);

    /* Configure FMC interface for SDRAM */
    ConfigureFMCSDRAM(SDRAM_BANK1);

    /* Configure SDRAM chip */
    ConfigureSDRAM(SDRAM_BANK1);

    /* Configure Refresh */
    ConfigureSDRAMRefresh(SDRAM_BANK1);

    return 0;
}

